utilitariosAdicionaServico/notacontrol.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ws="http://nfse.abrasf.org.br" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="nfse" targetNamespace="http://nfse.abrasf.org.br"><wsdl:types><xsd:schema targetNamespace="http://nfse.abrasf.org.br"><xsd:complexType name="input"><xsd:sequence><xsd:element name="nfseCabecMsg" type="xsd:string" minOccurs="1" maxOccurs="1" /><xsd:element name="nfseDadosMsg" type="xsd:string" minOccurs="1" maxOccurs="1" /></xsd:sequence></xsd:complexType><xsd:complexType name="output"><xsd:sequence><xsd:element name="outputXML" type="xsd:string" /></xsd:sequence></xsd:complexType><xsd:element name="CancelarNfse" type="ws:input" /><xsd:element name="CancelarNfseResponse" type="ws:output" /><xsd:element name="ConsultarLoteRps" type="ws:input" /><xsd:element name="ConsultarLoteRpsResponse" type="ws:output" /><xsd:element name="ConsultarNfseServicoPrestado" type="ws:input" /><xsd:element name="ConsultarNfseServicoPrestadoResponse" type="ws:output" /><xsd:element name="ConsultarNfseServicoTomado" type="ws:input" /><xsd:element name="ConsultarNfseServicoTomadoResponse" type="ws:output" /><xsd:element name="ConsultarNfsePorFaixa" type="ws:input" /><xsd:element name="ConsultarNfsePorFaixaResponse" type="ws:output" /><xsd:element name="ConsultarNfsePorRps" type="ws:input" /><xsd:element name="ConsultarNfsePorRpsResponse" type="ws:output" /><xsd:element name="RecepcionarLoteRps" type="ws:input" /><xsd:element name="RecepcionarLoteRpsResponse" type="ws:output" /><xsd:element name="GerarNfse" type="ws:input" /><xsd:element name="GerarNfseResponse" type="ws:output" /><xsd:element name="SubstituirNfse" type="ws:input" /><xsd:element name="SubstituirNfseResponse" type="ws:output" /><xsd:element name="RecepcionarLoteRpsSincrono" type="ws:input" /><xsd:element name="RecepcionarLoteRpsSincronoResponse" type="ws:output" /><xsd:element name="ConsultarUrlNfse" type="ws:input" /><xsd:element name="ConsultarUrlNfseResponse" type="ws:output" /><xsd:element name="ConsultarDadosCadastrais" type="ws:input" /><xsd:element name="ConsultarDadosCadastraisResponse" type="ws:output" /><xsd:element name="ConsultarRpsDisponivel" type="ws:input" /><xsd:element name="ConsultarRpsDisponivelResponse" type="ws:output" /></xsd:schema></wsdl:types><wsdl:message name="CancelarNfseRequest"><wsdl:part element="ws:CancelarNfse" name="parameters" /></wsdl:message><wsdl:message name="CancelarNfseResponse"><wsdl:part element="ws:CancelarNfseResponse" name="parameters" /></wsdl:message><wsdl:message name="ConsultarLoteRpsRequest"><wsdl:part element="ws:ConsultarLoteRps" name="parameters" /></wsdl:message><wsdl:message name="ConsultarLoteRpsResponse"><wsdl:part element="ws:ConsultarLoteRpsResponse" name="parameters" /></wsdl:message><wsdl:message name="ConsultarNfseServicoPrestadoRequest"><wsdl:part element="ws:ConsultarNfseServicoPrestado" name="parameters" /></wsdl:message><wsdl:message name="ConsultarNfseServicoPrestadoResponse"><wsdl:part element="ws:ConsultarNfseServicoPrestadoResponse" name="parameters" /></wsdl:message><wsdl:message name="ConsultarNfseServicoTomadoRequest"><wsdl:part element="ws:ConsultarNfseServicoTomado" name="parameters" /></wsdl:message><wsdl:message name="ConsultarNfseServicoTomadoResponse"><wsdl:part element="ws:ConsultarNfseServicoTomadoResponse" name="parameters" /></wsdl:message><wsdl:message name="ConsultarNfsePorFaixaRequest"><wsdl:part element="ws:ConsultarNfsePorFaixa" name="parameters" /></wsdl:message><wsdl:message name="ConsultarNfsePorFaixaResponse"><wsdl:part element="ws:ConsultarNfsePorFaixaResponse" name="parameters" /></wsdl:message><wsdl:message name="ConsultarNfsePorRpsRequest"><wsdl:part element="ws:ConsultarNfsePorRps" name="parameters" /></wsdl:message><wsdl:message name="ConsultarNfsePorRpsResponse"><wsdl:part element="ws:ConsultarNfsePorRpsResponse" name="parameters" /></wsdl:message><wsdl:message name="RecepcionarLoteRpsRequest"><wsdl:part element="ws:RecepcionarLoteRps" name="parameters" /></wsdl:message><wsdl:message name="RecepcionarLoteRpsResponse"><wsdl:part element="ws:RecepcionarLoteRpsResponse" name="parameters" /></wsdl:message><wsdl:message name="GerarNfseRequest"><wsdl:part element="ws:GerarNfse" name="parameters" /></wsdl:message><wsdl:message name="GerarNfseResponse"><wsdl:part element="ws:GerarNfseResponse" name="parameters" /></wsdl:message><wsdl:message name="SubstituirNfseRequest"><wsdl:part element="ws:SubstituirNfse" name="parameters" /></wsdl:message><wsdl:message name="SubstituirNfseResponse"><wsdl:part element="ws:SubstituirNfseResponse" name="parameters" /></wsdl:message><wsdl:message name="RecepcionarLoteRpsSincronoRequest"><wsdl:part element="ws:RecepcionarLoteRpsSincrono" name="parameters" /></wsdl:message><wsdl:message name="RecepcionarLoteRpsSincronoResponse"><wsdl:part element="ws:RecepcionarLoteRpsSincronoResponse" name="parameters" /></wsdl:message><wsdl:message name="ConsultarUrlNfseRequest"><wsdl:part element="ws:ConsultarUrlNfse" name="parameters" /></wsdl:message><wsdl:message name="ConsultarUrlNfseResponse"><wsdl:part element="ws:ConsultarUrlNfseResponse" name="parameters" /></wsdl:message><wsdl:message name="ConsultarDadosCadastraisRequest"><wsdl:part element="ws:ConsultarDadosCadastrais" name="parameters" /></wsdl:message><wsdl:message name="ConsultarDadosCadastraisResponse"><wsdl:part element="ws:ConsultarDadosCadastraisResponse" name="parameters" /></wsdl:message><wsdl:message name="ConsultarRpsDisponivelRequest"><wsdl:part element="ws:ConsultarRpsDisponivel" name="parameters" /></wsdl:message><wsdl:message name="ConsultarRpsDisponivelResponse"><wsdl:part element="ws:ConsultarRpsDisponivelResponse" name="parameters" /></wsdl:message><wsdl:portType name="nfse"><wsdl:operation name="CancelarNfse"><wsdl:input message="ws:CancelarNfseRequest" /><wsdl:output message="ws:CancelarNfseResponse" /></wsdl:operation><wsdl:operation name="ConsultarLoteRps"><wsdl:input message="ws:ConsultarLoteRpsRequest" /><wsdl:output message="ws:ConsultarLoteRpsResponse" /></wsdl:operation><wsdl:operation name="ConsultarNfseServicoPrestado"><wsdl:input message="ws:ConsultarNfseServicoPrestadoRequest" /><wsdl:output message="ws:ConsultarNfseServicoPrestadoResponse" /></wsdl:operation><wsdl:operation name="ConsultarNfseServicoTomado"><wsdl:input message="ws:ConsultarNfseServicoTomadoRequest" /><wsdl:output message="ws:ConsultarNfseServicoTomadoResponse" /></wsdl:operation><wsdl:operation name="ConsultarNfsePorFaixa"><wsdl:input message="ws:ConsultarNfsePorFaixaRequest" /><wsdl:output message="ws:ConsultarNfsePorFaixaResponse" /></wsdl:operation><wsdl:operation name="ConsultarNfsePorRps"><wsdl:input message="ws:ConsultarNfsePorRpsRequest" /><wsdl:output message="ws:ConsultarNfsePorRpsResponse" /></wsdl:operation><wsdl:operation name="RecepcionarLoteRps"><wsdl:input message="ws:RecepcionarLoteRpsRequest" /><wsdl:output message="ws:RecepcionarLoteRpsResponse" /></wsdl:operation><wsdl:operation name="GerarNfse"><wsdl:input message="ws:GerarNfseRequest" /><wsdl:output message="ws:GerarNfseResponse" /></wsdl:operation><wsdl:operation name="SubstituirNfse"><wsdl:input message="ws:SubstituirNfseRequest" /><wsdl:output message="ws:SubstituirNfseResponse" /></wsdl:operation><wsdl:operation name="RecepcionarLoteRpsSincrono"><wsdl:input message="ws:RecepcionarLoteRpsSincronoRequest" /><wsdl:output message="ws:RecepcionarLoteRpsSincronoResponse" /></wsdl:operation><wsdl:operation name="ConsultarUrlNfse"><wsdl:input message="ws:ConsultarUrlNfseRequest" /><wsdl:output message="ws:ConsultarUrlNfseResponse" /></wsdl:operation><wsdl:operation name="ConsultarDadosCadastrais"><wsdl:input message="ws:ConsultarDadosCadastraisRequest" /><wsdl:output message="ws:ConsultarDadosCadastraisResponse" /></wsdl:operation><wsdl:operation name="ConsultarRpsDisponivel"><wsdl:input message="ws:ConsultarRpsDisponivelRequest" /><wsdl:output message="ws:ConsultarRpsDisponivelResponse" /></wsdl:operation></wsdl:portType><wsdl:binding name="nfseSOAP" type="ws:nfse"><soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http" /><wsdl:operation name="CancelarNfse"><soap:operation soapAction="http://nfse.abrasf.org.br/CancelarNfse" /><wsdl:input><soap:body use="literal" /></wsdl:input><wsdl:output><soap:body use="literal" /></wsdl:output></wsdl:operation><wsdl:operation name="ConsultarLoteRps"><soap:operation soapAction="http://nfse.abrasf.org.br/ConsultarLoteRps" /><wsdl:input><soap:body use="literal" /></wsdl:input><wsdl:output><soap:body use="literal" /></wsdl:output></wsdl:operation><wsdl:operation name="ConsultarNfseServicoPrestado"><soap:operation soapAction="http://nfse.abrasf.org.br/ConsultarNfseServicoPrestado" /><wsdl:input><soap:body use="literal" /></wsdl:input><wsdl:output><soap:body use="literal" /></wsdl:output></wsdl:operation><wsdl:operation name="ConsultarNfseServicoTomado"><soap:operation soapAction="http://nfse.abrasf.org.br/ConsultarNfseServicoTomado" /><wsdl:input><soap:body use="literal" /></wsdl:input><wsdl:output><soap:body use="literal" /></wsdl:output></wsdl:operation><wsdl:operation name="ConsultarNfsePorFaixa"><soap:operation soapAction="http://nfse.abrasf.org.br/ConsultarNfsePorFaixa" /><wsdl:input><soap:body use="literal" /></wsdl:input><wsdl:output><soap:body use="literal" /></wsdl:output></wsdl:operation><wsdl:operation name="ConsultarNfsePorRps"><soap:operation soapAction="http://nfse.abrasf.org.br/ConsultarNfsePorRps" /><wsdl:input><soap:body use="literal" /></wsdl:input><wsdl:output><soap:body use="literal" /></wsdl:output></wsdl:operation><wsdl:operation name="RecepcionarLoteRps"><soap:operation soapAction="http://nfse.abrasf.org.br/RecepcionarLoteRps" /><wsdl:input><soap:body use="literal" /></wsdl:input><wsdl:output><soap:body use="literal" /></wsdl:output></wsdl:operation><wsdl:operation name="GerarNfse"><soap:operation soapAction="http://nfse.abrasf.org.br/GerarNfse" /><wsdl:input><soap:body use="literal" /></wsdl:input><wsdl:output><soap:body use="literal" /></wsdl:output></wsdl:operation><wsdl:operation name="SubstituirNfse"><soap:operation soapAction="http://nfse.abrasf.org.br/SubstituirNfse" /><wsdl:input><soap:body use="literal" /></wsdl:input><wsdl:output><soap:body use="literal" /></wsdl:output></wsdl:operation><wsdl:operation name="RecepcionarLoteRpsSincrono"><soap:operation soapAction="http://nfse.abrasf.org.br/RecepcionarLoteRpsSincrono" /><wsdl:input><soap:body use="literal" /></wsdl:input><wsdl:output><soap:body use="literal" /></wsdl:output></wsdl:operation><wsdl:operation name="ConsultarUrlNfse"><soap:operation soapAction="http://nfse.abrasf.org.br/ConsultarUrlNfse" /><wsdl:input><soap:body use="literal" /></wsdl:input><wsdl:output><soap:body use="literal" /></wsdl:output></wsdl:operation><wsdl:operation name="ConsultarDadosCadastrais"><soap:operation soapAction="http://nfse.abrasf.org.br/ConsultarDadosCadastrais" /><wsdl:input><soap:body use="literal" /></wsdl:input><wsdl:output><soap:body use="literal" /></wsdl:output></wsdl:operation><wsdl:operation name="ConsultarRpsDisponivel"><soap:operation soapAction="http://nfse.abrasf.org.br/ConsultarRpsDisponivel" /><wsdl:input><soap:body use="literal" /></wsdl:input><wsdl:output><soap:body use="literal" /></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="NfseWSService"><wsdl:port binding="ws:nfseSOAP" name="nfseSOAP"><soap:address location="nfse.asmx" /></wsdl:port></wsdl:service></wsdl:definitions>