NEST/src/Geral/Nfse/Templates/enviar-lote-rps.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:svc="http://nfse.abrasf.org.br">
  <soap:Body>
    <svc:RecepcionarLoteRps>
      <nfseCabecMsg>
        <cabecalho versao="1.00">
          <versaoDados>2.04</versaoDados>
        </cabecalho>
      </nfseCabecMsg>
      <nfseDadosMsg>
        <EnviarLoteRpsEnvio xmlns="http://www.abrasf.org.br/nfse.xsd">
          <LoteRps Id="{{loteId}}" versao="2.04">
            <NumeroLote>{{numeroLote}}</NumeroLote>
            <Prestador>
              <CpfCnpj>
                <Cnpj>{{prestador.cnpj}}</Cnpj>
              </CpfCnpj>
              <InscricaoMunicipal>{{prestador.inscricaoMunicipal}}</InscricaoMunicipal>
            </Prestador>
            <QuantidadeRps>{{quantidadeRps}}</QuantidadeRps>
            <ListaRps>
              <Rps>
                <InfDeclaracaoPrestacaoServico Id="{{infDeclaracaoId}}">
                  <Rps Id="{{rpsId}}">
                    <IdentificacaoRps>
                      <Numero>{{rps.numero}}</Numero>
                      <Serie>{{rps.serie}}</Serie>
                      <Tipo>{{rps.tipo}}</Tipo>
                    </IdentificacaoRps>
                    <DataEmissao>{{rps.dataEmissao}}</DataEmissao>
                    <Status>{{rps.status}}</Status>
                  </Rps>
                  <Competencia>{{competencia}}</Competencia>
                  <Servico>
                    <Valores>
                      <ValorServicos>{{servico.valores.valorServicos}}</ValorServicos>
                    </Valores>
                    <IssRetido>{{servico.issRetido}}</IssRetido>
                    <ItemListaServico>{{servico.itemListaServico}}</ItemListaServico>
                    <CodigoCnae>{{servico.codigoCnae}}</CodigoCnae>
                    <CodigoTributacaoMunicipio>{{servico.codigoTributacaoMunicipio}}</CodigoTributacaoMunicipio>
                    <Discriminacao>{{servico.discriminacao}}</Discriminacao>
                    <CodigoMunicipio>{{servico.codigoMunicipio}}</CodigoMunicipio>
                    <ExigibilidadeISS>{{servico.exigibilidadeISS}}</ExigibilidadeISS>
                    <MunicipioIncidencia>{{servico.municipioIncidencia}}</MunicipioIncidencia>
                  </Servico>
                  <Prestador>
                    <CpfCnpj>
                      <Cnpj>{{prestador.cnpj}}</Cnpj>
                    </CpfCnpj>
                    <InscricaoMunicipal>{{prestador.inscricaoMunicipal}}</InscricaoMunicipal>
                  </Prestador>
                  <TomadorServico>
                    <IdentificacaoTomador>
                      <CpfCnpj>
                        <Cpf>{{tomador.cpf}}</Cpf>
                      </CpfCnpj>
                    </IdentificacaoTomador>
                    <RazaoSocial>{{tomador.razaoSocial}}</RazaoSocial>
                    <Endereco>
                      <Endereco>{{tomador.endereco.endereco}}</Endereco>
                      <Numero>{{tomador.endereco.numero}}</Numero>
                      <Complemento>{{tomador.endereco.complemento}}</Complemento>
                      <Bairro>{{tomador.endereco.bairro}}</Bairro>
                      <CodigoMunicipio>{{tomador.endereco.codigoMunicipio}}</CodigoMunicipio>
                      <Uf>{{tomador.endereco.uf}}</Uf>
                      <Cep>{{tomador.endereco.cep}}</Cep>
                    </Endereco>
                  </TomadorServico>
                  <OptanteSimplesNacional>{{optanteSimplesNacional}}</OptanteSimplesNacional>
                  <IncentivoFiscal>{{incentivoFiscal}}</IncentivoFiscal>
                </InfDeclaracaoPrestacaoServico>
              </Rps>
            </ListaRps>
          </LoteRps>
        </EnviarLoteRpsEnvio>
      </nfseDadosMsg>
    </svc:RecepcionarLoteRps>
  </soap:Body>
</soap:Envelope>
